Revit 2027 API
RebarConstraintType Enumeration
 The various types of constraints that can be applied to a RebarConstrainedHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarConstraintType
Public Enumeration RebarConstraintType
public enum class RebarConstraintType
type RebarConstraintType
Members
Member name | Value | Description
FixedDistanceToHostFace | 0 |  Handle is constrained to remain a fixed distance from a host Element surface.
ToCover | 1 |  Handle is attached to the cover of a host Element surface.
ToCustomTarget | 6 |  Handle is constrained to a custom target which is identified by the [!:Autodesk::Revit::DB::Structure::IRebarUpdateServer] which is defining the handle.
ToHostEdge | 4 |  Handle is constrained to a host Element edge.
ToHostEdgeCover | 5 |  Handle is constrained to a host Element edge, where the constraint position is calculated at the intersection of the two adjacent faces, each offset inward by their cover distances.
ToOtherRebar | 2 |  Handle is attached to a handle on another Rebar Element. It doesn't matter the style (Standard/Stirrup) of this or the other Rebar element.
ToSurface | 3 |  Handle is constrained to a surface.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace